# EncryptAllPlugins

## Description
This will do batch encryption of all VectorScript plug-ins in the Plug-ins folder.

```pascal
PROCEDURE EncryptAllPlugins;
```

```python
def vs.EncryptAllPlugins():
    return None
```

## Remarks
This function is provided by an external plug-in that is not provided by the normal distribution of Vectorworks.

The plug-in is called ‘BatchEncryption’ and can be found inside ‘ToolsWin’ or ‘ToolsMac’ folders of the corresponding Vectorworks SDKs.

The Vectorworks SDK can be downloaded here:
http://www.vectorworks.net/support/custom/sdk/sdkdown.php

## See Also
EncryptPlugin

## Version
Availability: from Vectorworks 2014

## Category
* Utility